In [21]:
# create a sample data frame that has missing values

import numpy as np
import pandas as pd

data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":['Hyd','Blr','Pune',np.nan]}
#pd.DataFrame(data)
df=pd.DataFrame(data)
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [2]:
df=pd.DataFrame(data)
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [3]:
df.shape

(4, 3)

In [ ]:
## Im modifying the code

In [9]:
df.isnull()
# NAN : Not a Number
#np.nan

   Names   Ages   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [4]:
df.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

# Method -1: Fill with a random value

In [14]:
df.fillna(40)

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  Pune
3    Sita  21.0    40

In [18]:
df.fillna(40,inplace=True) 
#inplace=True --> means that the values that are missed will be filled with val=40

In [19]:
df ## We can see that all the missing values have been replaced with 40

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  Pune
3    Sita  21.0    40

# Method -2 :  Select a particular column and fill with a random number

In [ ]:
 ## Run the first cell again

In [22]:
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [23]:
import numpy as np
import pandas as pd

data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":['Hyd','Blr','Pune',np.nan]}

pd.DataFrame(data)

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [24]:
df.dtypes

Names     object
Ages     float64
City      object
dtype: object

In [24]:
df['Ages'].fillna(20) ## takes the dtype as : float

0    40.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [28]:
df['Ages'].fillna("20") ## takes the dtypes as : object

0      20
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: object

In [30]:
df['Ages'].fillna(20,inplace=True)
df

    Names  Ages  City
0     Ram  20.0   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [31]:
df['Names'].fillna('Krishna',inplace=True)
df

     Names  Ages  City
0      Ram  20.0   Hyd
1   Laxman  23.0   Blr
2  Krishna  22.0  Pune
3     Sita  21.0   NaN

In [32]:
df['City'].fillna('Chennai',inplace=True)
df

     Names  Ages     City
0      Ram  20.0      Hyd
1   Laxman  23.0      Blr
2  Krishna  22.0     Pune
3     Sita  21.0  Chennai

In [33]:
df

     Names  Ages     City
0      Ram  20.0      Hyd
1   Laxman  23.0      Blr
2  Krishna  22.0     Pune
3     Sita  21.0  Chennai

# Method -3 : Padding

In [34]:
import numpy as np
import pandas as pd

data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":['Hyd','Blr','Pune',np.nan]}

pd.DataFrame(data)

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [35]:
df=pd.DataFrame(data)
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [36]:
df.fillna(method='pad')
## padding --missing values gets replaced with previous values (upper values)

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [37]:
df.fillna(method='bfill') 
## bfill - missing values are getting replaced with next values on the column way

    Names  Ages  City
0     Ram  23.0   Hyd
1  Laxman  23.0   Blr
2    Sita  22.0  Pune
3    Sita  21.0   NaN

In [38]:
df.fillna(method='backfill')
## backfill and bfill works as same

    Names  Ages  City
0     Ram  23.0   Hyd
1  Laxman  23.0   Blr
2    Sita  22.0  Pune
3    Sita  21.0   NaN

In [42]:
df.fillna(method='ffill') ## same as of pad fill

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

# Method -4: Fill the missing values using axis

In [43]:
import numpy as np
import pandas as pd

data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":['Hyd','Blr','Pune',np.nan]}

df=pd.DataFrame(data)
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [44]:
# Axis=0 rows
# Axis=1 columns
df.fillna(method='pad',axis=1) ##  missing values are getting filled with previous col - row-wise val

    Names  Ages  City
0     Ram   Ram   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0  21.0

In [45]:
# Axis=0 rows
# Axis=1 columns
df.fillna(method='pad',axis=0)

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [ ]:
## the above one working with rows
## We should not work with columns , since of the drawback of age getting filled with names

In [54]:
df.fillna(method='pad')

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

# Method-5:
- Random
- pad
- bfill - > before fill
- mean - median - mode

In [46]:
import numpy as np
import pandas as pd

data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":['Hyd','Blr','Pune',np.nan]}

df=pd.DataFrame(data)

In [49]:
mean_age=df['Ages'].mean()
mean_age

22.0

In [50]:
df['Ages'].fillna(mean_age)   ## missing values gets replaced with the mean values

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [51]:
# If outliers are there fill with median values
median_age=df['Ages'].median()
median_age

22.0

In [52]:
df['Ages'].fillna(median_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [54]:
mode_age=df['Ages'].mode()
mode_age

0    21.0
1    22.0
2    23.0
Name: Ages, dtype: float64

In [55]:
df['Ages'].fillna(mode_age)

0    21.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64